<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"prod","backend":"703e3e7a7c774c7e5c6da5d9796b42a46faecca1c1d21fc5c11988d23664df07","plan_job_ref":"Job Environment Prod - Plan #182 at https://github.com/jarrod-lowe/dnd-planner/actions/runs/23673337918","plan_out_hash":"58d96ea3c77ec1ec188f35a9f605f1bfd801b3d2a3b3a89446d908d43054cfde","plan_hash":"8895ff80573a2d341c4d47adce35288be6d9c3e39fe9a2aa0018e6d76f112783","plan_text_format":"diff","version":"2.2.3"} -->
Terraform plan for __prod__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.dnd-planner.data.aws_iam_policy_document.create_character_dynamodb will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "create_character_dynamodb" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "dynamodb:PutItem",
+               "dynamodb:Query",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:dynamodb:ap-southeast-2:021891603679:table/dnd-planner-prod-data",
+               "arn:aws:dynamodb:ap-southeast-2:021891603679:table/dnd-planner-prod-data/index/*",
            ]
        }
    }

  # module.dnd-planner.data.aws_iam_policy_document.post_confirmation_dynamodb will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "post_confirmation_dynamodb" {
+       id            = (known after apply)
+       json          = (known after apply)
+       minified_json = (known after apply)

+       statement {
+           actions   = [
+               "dynamodb:PutItem",
+               "dynamodb:Query",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:dynamodb:ap-southeast-2:021891603679:table/dnd-planner-prod-data",
+               "arn:aws:dynamodb:ap-southeast-2:021891603679:table/dnd-planner-prod-data/index/*",
            ]
        }
    }

  # module.dnd-planner.aws_api_gateway_account.main will be updated in-place
!~  resource "aws_api_gateway_account" "main" {
!~      api_key_version     = "*" -> (known after apply)
!~      cloudwatch_role_arn = "arn:aws:iam::021891603679:role/dnd-planner-test-api-logging" -> "arn:aws:iam::021891603679:role/dnd-planner-prod-api-logging"
!~      features            = [
-           "UsagePlans",
        ] -> (known after apply)
        id                  = "021891603679"
!~      throttle_settings   = [
-           {
-               burst_limit = 5000
-               rate_limit  = 10000
            },
        ] -> (known after apply)
#        (1 unchanged attribute hidden)
    }

  # module.dnd-planner.aws_dynamodb_table.data will be updated in-place
!~  resource "aws_dynamodb_table" "data" {
        id                          = "dnd-planner-prod-data"
        name                        = "dnd-planner-prod-data"
        tags                        = {
            "Name" = "dnd-planner-prod-data"
        }
#        (14 unchanged attributes hidden)

+       attribute {
+           name = "GSI1PK"
+           type = "S"
        }
+       attribute {
+           name = "GSI1SK"
+           type = "S"
        }

-       global_secondary_index {
-           hash_key           = "gsiSeedPK" -> null
-           name               = "gsiSeed" -> null
-           non_key_attributes = [] -> null
-           projection_type    = "ALL" -> null
-           read_capacity      = 0 -> null
-           write_capacity     = 0 -> null
#            (1 unchanged attribute hidden)

-           key_schema {
-               attribute_name = "gsiSeedPK" -> null
-               key_type       = "HASH" -> null
            }
        }
+       global_secondary_index {
+           hash_key           = (known after apply)
+           name               = "gsi1"
+           non_key_attributes = []
+           projection_type    = "KEYS_ONLY"
+           read_capacity      = (known after apply)
+           write_capacity     = (known after apply)
#            (1 unchanged attribute hidden)

+           key_schema {
+               attribute_name = "GSI1PK"
+               key_type       = "HASH"
            }
+           key_schema {
+               attribute_name = "GSI1SK"
+               key_type       = "RANGE"
            }

+           warm_throughput (known after apply)
        }
+       global_secondary_index {
+           hash_key           = (known after apply)
+           name               = "gsiSeed"
+           non_key_attributes = []
+           projection_type    = "ALL"
+           read_capacity      = (known after apply)
+           write_capacity     = (known after apply)
#            (1 unchanged attribute hidden)

+           key_schema {
+               attribute_name = "gsiSeedPK"
+               key_type       = "HASH"
            }

+           warm_throughput (known after apply)
        }

#        (5 unchanged blocks hidden)
    }

  # module.dnd-planner.aws_iam_role_policy.create_character_dynamodb will be updated in-place
!~  resource "aws_iam_role_policy" "create_character_dynamodb" {
        id          = "dnd-planner-prod-create-character:dnd-planner-prod-create-character-dynamodb"
        name        = "dnd-planner-prod-create-character-dynamodb"
!~      policy      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "dynamodb:Query",
-                           "dynamodb:PutItem",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:dynamodb:ap-southeast-2:021891603679:table/dnd-planner-prod-data/index/*",
-                           "arn:aws:dynamodb:ap-southeast-2:021891603679:table/dnd-planner-prod-data",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (2 unchanged attributes hidden)
    }

  # module.dnd-planner.aws_iam_role_policy.post_confirmation_dynamodb will be updated in-place
!~  resource "aws_iam_role_policy" "post_confirmation_dynamodb" {
        id          = "dnd-planner-prod-post-confirmation:dnd-planner-prod-post-confirmation-dynamodb"
        name        = "dnd-planner-prod-post-confirmation-dynamodb"
!~      policy      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "dynamodb:Query",
-                           "dynamodb:PutItem",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:dynamodb:ap-southeast-2:021891603679:table/dnd-planner-prod-data/index/*",
-                           "arn:aws:dynamodb:ap-southeast-2:021891603679:table/dnd-planner-prod-data",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
#        (2 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:orange_circle: Applying plan in [Environment Prod - Deploy #84](https://github.com/jarrod-lowe/dnd-planner/actions/runs/23673373671)